---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementGeometryResults.GetGeometry
source: html/380d4823-fbbd-e73b-9358-51f704a5fa1f.htm
---
# Autodesk.Revit.DB.SpatialElementGeometryResults.GetGeometry Method

The solid from the spatial element.

## Syntax (C#)
```csharp
public Solid GetGeometry()
```

## Returns
Requested solid.